In [2]:
import numpy as np
import pandas as pd

In [5]:
people = {
    "first": ["Har", 'Jonny', 'Amit', np.nan, None, 'NA'], 
    "last": ["Mesh", 'Harode', 'Shukla', np.nan, np.nan, 'Missing'], 
    "email": ["harmesh@gmail.com", 'jonnyharode@email.com', 'amitshukla@email.com', None, np.nan, np.nan],
    "age" : ['23', '34', '33', None, None, 'Missing']
}

In [13]:
df = pd.DataFrame(people)

df.replace('NA', np.nan, inplace=True)
df.replace('Missing', np.nan, inplace=True)

In [20]:
df

   first    last                  email   age
0    Har    Mesh      harmesh@gmail.com    23
1  Jonny  Harode  jonnyharode@email.com    34
2   Amit  Shukla   amitshukla@email.com    33
3    NaN     NaN                   None  None
4   None     NaN                    NaN  None
5    NaN     NaN                    NaN   NaN

In [21]:
df.dropna()

   first    last                  email age
0    Har    Mesh      harmesh@gmail.com  23
1  Jonny  Harode  jonnyharode@email.com  34
2   Amit  Shukla   amitshukla@email.com  33

In [22]:
df.dropna(axis='index', how='any')

   first    last                  email age
0    Har    Mesh      harmesh@gmail.com  23
1  Jonny  Harode  jonnyharode@email.com  34
2   Amit  Shukla   amitshukla@email.com  33

In [23]:
df.dropna(axis='columns', how='any')

Empty DataFrame
Columns: []
Index: [0, 1, 2, 3, 4, 5]

In [24]:
df.dropna(axis='index', how='all', subset=['last', 'email'])

   first    last                  email age
0    Har    Mesh      harmesh@gmail.com  23
1  Jonny  Harode  jonnyharode@email.com  34
2   Amit  Shukla   amitshukla@email.com  33

In [25]:
df.isna()

   first   last  email    age
0  False  False  False  False
1  False  False  False  False
2  False  False  False  False
3   True   True   True   True
4   True   True   True   True
5   True   True   True   True

In [26]:
df.fillna('MISSING')

     first     last                  email      age
0      Har     Mesh      harmesh@gmail.com       23
1    Jonny   Harode  jonnyharode@email.com       34
2     Amit   Shukla   amitshukla@email.com       33
3  MISSING  MISSING                MISSING  MISSING
4  MISSING  MISSING                MISSING  MISSING
5  MISSING  MISSING                MISSING  MISSING

In [27]:
df.fillna(0)

   first    last                  email age
0    Har    Mesh      harmesh@gmail.com  23
1  Jonny  Harode  jonnyharode@email.com  34
2   Amit  Shukla   amitshukla@email.com  33
3      0       0                      0   0
4      0       0                      0   0
5      0       0                      0   0

In [28]:
df.dtypes

first    object
last     object
email    object
age      object
dtype: object

In [29]:
df['age'].mean()

TypeError: can only concatenate str (not "int") to str

In [30]:
type(np.nan)

float

In [31]:
df['age'] = df['age'].astype(float)

In [32]:
df.dtypes

first     object
last      object
email     object
age      float64
dtype: object

In [33]:
df['age'].mean()

30.0

In [34]:
df.astype()

TypeError: astype() missing 1 required positional argument: 'dtype'